let cards = [
'2♥', '3♥', '4♥', '5♥', '6♥', '7♥', '8♥', '9♥', '10♥', 'В♥', 'Д♥', 'К♥', 'A♥',
'2♦', '3♦', '4♦', '5♦', '6♦', '7♦', '8♦', '9♦', '10♦', 'В♦', 'Д♦', 'К♦', 'A♦',
'2♣', '3♣', '4♣', '5♣', '6♣', '7♣', '8♣', '9♣', '10♣', 'В♣', 'Д♣', 'К♣', 'A♣',
'2♠', '3♠', '4♠', '5♠', '6♠', '7♠', '8♠', '9♠', '10♠', 'В♠', 'Д♠', 'К♠', 'A♠'];

let score = {
  '2♥': 2,
  '2♦': 2,
  '2♣': 2,
  '2♠': 2,
  '3♥': 3,
  '3♦': 3,
  '3♣': 3,
  '3♠': 3,
  '4♥': 4,
  '4♦': 4,
  '4♣': 4,
  '4♠': 4,
  '5♥': 5,
  '5♦': 5,
  '5♣': 5,
  '5♠': 5,
  '6♥': 6,
  '6♦': 6,
  '6♣': 6,
  '6♠': 6,
  '7♥': 7,
  '7♦': 7,
  '7♣': 7,
  '7♠': 7,
  '8♥': 8,
  '8♦': 8,
  '8♣': 8,
  '8♠': 8,
  '9♥': 9,
  '9♦': 9,
  '9♣': 9,
  '9♠': 9,
  '10♥': 10,
  '10♦': 10,
  '10♣': 10,
  '10♠': 10,
  'В♥': 2,
  'В♦': 2,
  'В♣': 2,
  'В♠': 2,
  'Д♥': 3,
  'Д♦': 3,
  'Д♣': 3,
  'Д♠': 3,
  'К♥': 4,
  'К♦': 4,
  'К♣': 4,
  'К♠': 4,
  'А♥': 11,
  'А♦': 11,
  'А♣': 11,
  'А♠': 11
};

let menu = {
  reply_markup: JSON.stringify({
    inline_keyboard: [
      [
        { text: "Начать игру 🃏", callback_data: 'play' }
      ]
    ]
  })
};

let again_card = {
  reply_markup: JSON.stringify({
    inline_keyboard: [
      [
        { text: "Еще карту 🔁", callback_data: 'again_card' }
      ]
    ]
  })
}

let rand = Math.floor(Math.random()) * cards.length;

module.exports.cards = cards;
module.exports.score = score;
module.exports.menu = menu;
module.exports.rand = rand;
module.exports.again_card = again_card;
